-- MySQL dump 10.13  Distrib 5.7.25, for Linux (x86_64)
--
-- Host: localhost    Database: db_data
-- ------------------------------------------------------
-- Server version	5.7.18-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `t_countrys`
--

DROP TABLE IF EXISTS `t_countrys`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `t_countrys` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `continent_id` int(11) NOT NULL COMMENT '大陆ID',
  `code` varchar(20) NOT NULL COMMENT 'CODE',
  `name` varchar(255) NOT NULL COMMENT '名称',
  `status` int(1) NOT NULL DEFAULT '1' COMMENT '状态',
  PRIMARY KEY (`id`),
  KEY `code` (`code`,`continent_id`)
) ENGINE=InnoDB AUTO_INCREMENT=213 DEFAULT CHARSET=utf8 COMMENT='国家';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_countrys`
--

LOCK TABLES `t_countrys` WRITE;
/*!40000 ALTER TABLE `t_countrys` DISABLE KEYS */;
INSERT INTO `t_countrys` VALUES (1,1,'ZG','中国',1),(2,1,'RB','日本',1),(3,1,'CX','朝鲜',1),(4,1,'HG','韩国',1),(5,1,'MG','蒙古',1),(6,1,'ELS','俄罗斯',1),(7,1,'MD','缅甸',1),(8,1,'WL','文莱',1),(9,1,'JBZ','柬埔寨',1),(10,1,'DD','东帝汶',1),(11,1,'YDNXY','印度尼西亚',1),(12,1,'LW','老挝',1),(13,1,'MLXY','马来西亚',1),(14,1,'FLB','菲律宾',1),(15,1,'XJP','新加坡',1),(16,1,'TG','泰国',1),(17,1,'YN','越南',1),(18,1,'MJLG','孟加拉国',1),(19,1,'BD','不丹',1),(20,1,'YD','印度',1),(21,1,'MEDF','马尔代夫',1),(22,1,'NPE','尼泊尔',1),(23,1,'BJST','巴基斯坦',1),(24,1,'SLLK','斯里兰卡',1),(25,1,'HSKST','哈萨克斯坦',1),(26,1,'JEJSST','吉尔吉斯斯坦',1),(27,1,'TJKST','塔吉克斯坦',1),(28,1,'TKMST','土库曼斯坦',1),(29,1,'WZBKST','乌兹别克斯坦',1),(30,1,'AFH','阿富汗',1),(31,1,'YMNY','亚美尼亚',1),(32,1,'ASBJ','阿塞拜疆',1),(33,1,'BL','巴林',1),(34,1,'SPLS','塞浦路斯',1),(35,1,'GLJY','格鲁吉亚',1),(36,1,'YL','伊朗',1),(37,1,'YLK','伊拉克',1),(38,1,'YSL','以色列',1),(39,1,'KWT','科威特',1),(40,1,'LBN','黎巴嫩',1),(41,1,'AM','阿曼',1),(42,1,'BLST','巴勒斯坦',1),(43,1,'KTE','卡塔尔',1),(44,1,'STALB','沙特阿拉伯',1),(45,1,'XLY','叙利亚',1),(46,1,'TEQ','土耳其',1),(47,1,'ALBLHQZG','阿拉伯联合酋长国',1),(48,1,'YM','也门',1),(49,2,'AEBNY','阿尔巴尼亚',1),(50,2,'ADE','安道尔',1),(51,2,'BLS','比利时',1),(52,2,'SNY','斯尼亚',1),(53,2,'DG','德国',1),(54,2,'BJLY','保加利亚',1),(55,2,'DM','丹麦',1),(56,2,'ASNY','爱沙尼亚',1),(57,2,'FL','芬兰',1),(58,2,'FG','法国',1),(59,2,'XL','希腊',1),(60,2,'YG','英国',1),(61,2,'AEL','爱尔兰',1),(62,2,'BD','冰岛',1),(63,2,'YDL','意大利',1),(64,2,'SEWY','塞尔维亚',1),(65,2,'HS','黑山',1),(66,2,'KLDY','克罗地亚',1),(67,2,'LTWY','拉脱维亚',1),(68,2,'LZDSD','列支敦士登',1),(69,2,'LTW','立陶宛',1),(70,2,'LSB','卢森堡',1),(71,2,'MQD','马其顿',1),(72,2,'MET','马耳他',1),(73,2,'MNG','摩纳哥',1),(74,2,'HL','荷兰',1),(75,2,'NW','挪威',1),(76,2,'ADL','奥地利',1),(77,2,'BL','波兰',1),(78,2,'PTY','葡萄牙',1),(79,2,'LMNY','罗马尼亚',1),(80,2,'SMLN','圣马力诺',1),(81,2,'RD','瑞典',1),(82,2,'RS','瑞士',1),(83,2,'SLFK','斯洛伐克',1),(84,2,'SLWNY','斯洛文尼亚',1),(85,2,'XBY','西班牙',1),(86,2,'JK','捷克',1),(87,2,'XYL','匈牙利',1),(88,2,'FDG','梵蒂冈',1),(89,3,'AJ','埃及',1),(90,3,'SD','苏丹',1),(91,3,'LBY','利比亚',1),(92,3,'TNS','突尼斯',1),(93,3,'AEJLY','阿尔及利亚',1),(94,3,'MLG','摩洛哥',1),(95,3,'YSEQD','亚速尔群岛',1),(96,3,'MDLQD','马德拉群岛',1),(97,3,'ASEBY','埃塞俄比亚',1),(98,3,'ELTLY','厄立特里亚',1),(99,3,'SML','索马里',1),(100,3,'JBT','吉布提',1),(101,3,'KNY','肯尼亚',1),(102,3,'TSNY','坦桑尼亚',1),(103,3,'WGD','乌干达',1),(104,3,'LWD','卢旺达',1),(105,3,'BLD','布隆迪',1),(106,3,'SSE','塞舌尔',1),(107,3,'MLTNY','毛里塔尼亚',1),(108,3,'XSHL','西撒哈拉',1),(109,3,'SNJE','塞内加尔',1),(110,3,'GBY','冈比亚',1),(111,3,'ML','马里',1),(112,3,'BJNFS','布基纳法索',1),(113,3,'JNY','几内亚',1),(114,3,'JNYBS','几内亚比绍',1),(115,3,'FDJ','佛得角',1),(116,3,'SLLA','塞拉利昂',1),(117,3,'LBLY','利比里亚',1),(118,3,'KTDW','科特迪瓦',1),(119,3,'JN','加纳',1),(120,3,'DG','多哥',1),(121,3,'BN','贝宁',1),(122,3,'NRE','尼日尔',1),(123,3,'NRLY','尼日利亚',1),(124,3,'JNLQD','加那利群岛',1),(125,3,'ZD','乍得',1),(126,3,'ZF','中非',1),(127,3,'KML','喀麦隆',1),(128,3,'CDJNY','赤道几内亚',1),(129,3,'JP','加蓬',1),(130,3,'GG','刚果',1),(131,3,'SDM','圣多美',1),(132,3,'PLXB','普林西比',1),(133,3,'ZBY','赞比亚',1),(134,3,'AGL','安哥拉',1),(135,3,'JBBW','津巴布韦',1),(136,3,'MLW','马拉维',1),(137,3,'MSBK','莫桑比克',1),(138,3,'BCWN','博茨瓦纳',1),(139,3,'NMBY','纳米比亚',1),(140,3,'NF','南非',1),(141,3,'SWSL','斯威士兰',1),(142,3,'LST','莱索托',1),(143,3,'MDJSJ','马达加斯加',1),(144,3,'MLQS','毛里求斯',1),(145,3,'LNWD','留尼汪岛',1),(146,3,'SHLND','圣赫勒拿岛',1),(147,3,'ASSD','阿森松岛',1),(148,4,'GLBY','哥伦比亚',1),(149,4,'WNRL','委内瑞拉',1),(150,4,'GYN','圭亚那',1),(151,4,'SLN','苏里南',1),(152,4,'EGDE','厄瓜多尔',1),(153,4,'ML','秘鲁',1),(154,4,'BX','巴西',1),(155,4,'BLWY','玻利维亚',1),(156,4,'ZL','智利',1),(157,4,'BLG','巴拉圭',1),(158,4,'WLG','乌拉圭',1),(159,4,'AGT','阿根廷',1),(160,4,'FSGYN','法属圭亚那',1),(161,5,'BHM','巴哈马',1),(162,5,'BLZ','伯利兹',1),(163,5,'MG','美国',1),(164,5,'BBDS','巴巴多斯',1),(165,5,'JND','加拿大',1),(166,5,'GSDLJ','哥斯达黎加',1),(167,5,'GB','古巴',1),(168,5,'SEWD','萨尔瓦多',1),(169,5,'GLND','格林纳达',1),(170,5,'WDML','危地马拉',1),(171,5,'HDLS','洪都拉斯',1),(172,5,'HD','海地',1),(173,5,'YMJ','牙买加',1),(174,5,'SLXY','圣卢西亚',1),(175,5,'MXG','墨西哥',1),(176,5,'NJLG','尼加拉瓜',1),(177,5,'BNM','巴拿马',1),(178,5,'DMNJ','多米尼加',1),(179,5,'DMNK','多米尼克',1),(180,5,'SWST','圣文森特',1),(181,5,'GLNDS','格林纳丁斯',1),(182,5,'TLND','特立尼达',1),(183,5,'DBG','多巴哥',1),(184,5,'ATG','安提瓜',1),(185,5,'BBD','巴布达',1),(186,5,'SJC','圣基茨',1),(187,5,'NWS','尼维斯',1),(188,6,'ADLY','澳大利亚',1),(189,6,'XXL','新西兰',1),(190,6,'BBYXJNY','巴布亚新几内亚',1),(191,6,'SLMQD','所罗门群岛',1),(192,6,'BMLYNQD','北马里亚纳群岛',1),(193,6,'WNAT','瓦努阿图',1),(194,6,'PL','帕劳',1),(195,6,'NL','瑙鲁',1),(196,6,'TWL','图瓦卢',1),(197,6,'JLBS','基里巴斯',1),(198,6,'SMY','萨摩亚',1),(199,6,'MSSMY','美属萨摩亚',1),(200,6,'NA','纽埃',1),(201,6,'KKQD','库克群岛',1),(202,6,'TJ','汤加',1),(203,6,'MKLNXYLB','密克罗尼西亚联邦',1),(204,6,'PTKE','皮特凯恩',1),(205,6,'XKLDNY','新喀里多尼亚',1),(206,6,'FJQD','斐济群岛',1),(207,6,'MKLNYLB','密克罗尼亚联邦',1),(208,6,'MSEQD','马绍尔群岛',1),(209,6,'GD','关岛',1),(210,6,'TKL','托克劳',1),(211,6,'WLSHFTN','瓦利斯和富图纳',1),(212,6,'FSBLNXY','法属波利尼西亚',1);
/*!40000 ALTER TABLE `t_countrys` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-04-28 17:36:11
